[
  {"input": "Priya was born on 1991-09-05 at 21:28 in Kolkata. The planetary positions were: Sun in Virgo, Moon in Leo, Mercury in Leo, Venus in Leo. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 26 and 29. Love marriage is likely due to Saturn in Leo."},
{"input": "Anjali was born on 1992-06-04 at 07:54 in Ahmedabad. The planetary positions were: Sun in Virgo, Moon in Leo, Venus in Libra, Mars in Libra, Jupiter in Scorpio, Saturn in Aries. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 28 and 30. Love marriage is likely due to Venus in Aquarius."},
{"input": "Vikram was born on 1995-05-09 at 17:03 in Kolkata. The planetary positions were: Sun in Sagittarius, Moon in Leo, Venus in Capricorn, Mars in Scorpio, Jupiter in Cancer, Saturn in Pisces. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 27 and 29. Love marriage is likely due to Saturn in Sagittarius."},
{"input": "Anjali was born on 1990-10-16 at 02:56 in Bangalore. The planetary positions were: Sun in Pisces, Moon in Virgo, Venus in Leo, Mars in Virgo, Jupiter in Sagittarius, Saturn in Virgo. The question is: Will I marry someone from abroad?", "output": "Your planetary alignment suggests marriage between ages 26 and 30. Love marriage is likely due to Jupiter in Pisces."},
{"input": "Sahil was born on 1986-12-14 at 17:10 in Jaipur. The planetary positions were: Sun in Scorpio, Moon in Aries, Venus in Sagittarius, Mars in Virgo, Jupiter in Sagittarius, Saturn in Capricorn. The question is: Will I marry someone from abroad?", "output": "Your planetary alignment suggests marriage between ages 28 and 32. Love marriage is likely due to Jupiter in Scorpio."},
{"input": "Meera was born on 1988-01-26 at 13:45 in Jaipur. The planetary positions were: Sun in Libra, Moon in Taurus, Venus in Scorpio, Mars in Aries, Jupiter in Aquarius, Saturn in Scorpio. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 27 and 32. Love marriage is likely due to Mars in Gemini."},
{"input": "Sahil was born on 2000-01-09 at 22:47 in Pune. The planetary positions were: Sun in Sagittarius, Moon in Pisces, Venus in Pisces, Mars in Scorpio, Jupiter in Aries, Saturn in Gemini. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 28 and 31. Love marriage is likely due to Mars in Capricorn."},
{"input": "Meera was born on 1994-01-02 at 07:08 in Chennai. The planetary positions were: Sun in Capricorn, Moon in Capricorn, Venus in Sagittarius, Mars in Gemini, Jupiter in Taurus, Saturn in Aries. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 28 and 30. Love marriage is likely due to Jupiter in Capricorn."},
{"input": "Sahil was born on 1988-11-01 at 23:00 in Jaipur. The planetary positions were: Sun in Pisces, Moon in Leo, Venus in Virgo, Mars in Scorpio, Jupiter in Scorpio, Saturn in Gemini. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 27 and 30. Love marriage is likely due to Jupiter in Aries."},
{"input": "Sahil was born on 1986-01-15 at 05:48 in Lucknow. The planetary positions were: Sun in Virgo, Moon in Leo, Venus in Leo, Mars in Scorpio, Jupiter in Cancer, Saturn in Leo. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 27 and 32. Love marriage is likely due to Mars in Scorpio."},
{"input": "Sahil was born on 1994-02-06 at 08:56 in Hyderabad. The planetary positions were: Sun in Cancer, Moon in Leo, Venus in Scorpio, Mars in Scorpio, Jupiter in Taurus, Saturn in Sagittarius. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 26 and 31. Love marriage is likely due to Mars in Aquarius."},
{"input": "Sneha was born on 1997-03-18 at 18:05 in Jaipur. The planetary positions were: Sun in Capricorn, Moon in Pisces, Venus in Cancer, Mars in Taurus, Jupiter in Cancer, Saturn in Libra. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 26 and 32. Love marriage is likely due to Venus in Cancer."},
{"input": "Amit was born on 1986-03-18 at 18:23 in Pune. The planetary positions were: Sun in Gemini, Moon in Pisces, Venus in Libra, Mars in Capricorn, Jupiter in Libra, Saturn in Aries. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 28 and 30. Love marriage is likely due to Jupiter in Aquarius."},
{"input": "Vikram was born on 1994-04-02 at 02:11 in Chennai. The planetary positions were: Sun in Taurus, Moon in Gemini, Venus in Aries, Mars in Gemini, Jupiter in Sagittarius, Saturn in Taurus. The question is: Will I marry someone from abroad?", "output": "Your planetary alignment suggests marriage between ages 28 and 29. Love marriage is likely due to Venus in Capricorn."},
{"input": "Neha was born on 2003-10-19 at 17:27 in Delhi. The planetary positions were: Sun in Leo, Moon in Taurus, Venus in Aries, Mars in Pisces, Jupiter in Aquarius, Saturn in Virgo. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 27 and 31. Love marriage is likely due to Mars in Aquarius."},
{"input": "Karan was born on 1994-11-22 at 16:39 in Lucknow. The planetary positions were: Sun in Gemini, Moon in Virgo, Venus in Libra, Mars in Capricorn, Jupiter in Cancer, Saturn in Scorpio. The question is: Will I marry someone from abroad?", "output": "Your planetary alignment suggests marriage between ages 27 and 31. Love marriage is likely due to Jupiter in Aries."},
{"input": "Vikram was born on 1987-03-10 at 06:32 in Kolkata. The planetary positions were: Sun in Aquarius, Moon in Gemini, Venus in Cancer, Mars in Leo, Jupiter in Cancer, Saturn in Aquarius. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 26 and 31. Love marriage is likely due to Jupiter in Taurus."},
{"input": "Vikram was born on 2001-06-04 at 06:03 in Jaipur. The planetary positions were: Sun in Virgo, Moon in Pisces, Venus in Taurus, Mars in Cancer, Jupiter in Scorpio, Saturn in Aries. The question is: Will I have a love marriage or arranged marriage?", "output": "Your planetary alignment suggests marriage between ages 26 and 32. Love marriage is likely due to Mars in Sagittarius."},
{"input": "Rahul was born on 1997-12-26 at 11:31 in Delhi. The planetary positions were: Sun in Aries, Moon in Aries, Venus in Scorpio, Mars in Leo, Jupiter in Aquarius, Saturn in Sagittarius. The question is: When will I get married?", "output": "Your planetary alignment suggests marriage between ages 28 and 32. Love marriage is likely due to Venus in Scorpio."},
{"input": "Meera was born on 1988-12-24 at 00:27 in Ahmedabad. The planetary positions were: Sun in Gemini, Moon in Virgo, Venus in Gemini, Mars in Virgo, Jupiter in Leo, Saturn in Libra. The question is: Will I marry someone from abroad?", "output": "Your planetary alignment suggests marriage between ages 28 and 31. Love marriage is likely due to Mars in Virgo."},
{"input": "Rahul was born on 1990-04-09 at 04:49 in Bangalore. The planetary positions were: Sun in Pisces, Moon in Taurus, Venus in Libra, Mars in Sagittarius, Jupiter in Sagittarius, Saturn in Aries. The question is: Should I change my job this year?", "output": "With Jupiter in Aries, your chart supports creative careers. Expect progress around 2027."},
{"input": "Priya was born on 1998-11-02 at 05:11 in Mumbai. The planetary positions were: Sun in Taurus, Moon in Libra, Venus in Aries, Mars in Libra, Jupiter in Scorpio, Saturn in Pisces. The question is: Should I change my job this year?", "output": "With Mars in Libra, your chart supports leadership roles. Expect progress around 2029."},
{"input": "Priya was born on 1989-09-08 at 07:45 in Chennai. The planetary positions were: Sun in Gemini, Moon in Leo, Venus in Libra, Mars in Aries, Jupiter in Sagittarius, Saturn in Aries. The question is: Will I succeed in business?", "output": "With Mars in Aries, your chart supports leadership roles. Expect progress around 2028."},
{"input": "Vikram was born on 1995-12-28 at 02:21 in Kolkata. The planetary positions were: Sun in Pisces, Moon in Aries, Venus in Pisces, Mars in Capricorn, Jupiter in Aquarius, Saturn in Gemini. The question is: Should I change my job this year?", "output": "With Jupiter in Sagittarius, your chart supports public service. Expect progress around 2029."},
{"input": "Neha was born on 1986-08-17 at 04:47 in Lucknow. The planetary positions were: Sun in Aries, Moon in Scorpio, Venus in Gemini, Mars in Pisces, Jupiter in Aries, Saturn in Pisces. The question is: Should I change my job this year?", "output": "With Venus in Leo, your chart supports public service. Expect progress around 2025."},
{"input": "Anjali was born on 1998-03-17 at 03:59 in Kolkata. The planetary positions were: Sun in Libra, Moon in Cancer, Venus in Sagittarius, Mars in Gemini, Jupiter in Pisces, Saturn in Scorpio. The question is: Should I change my job this year?", "output": "With Mars in Gemini, your chart supports leadership roles. Expect progress around 2025."},
{"input": "Anjali was born on 1992-10-18 at 16:57 in Delhi. The planetary positions were: Sun in Cancer, Moon in Libra, Venus in Leo, Mars in Pisces, Jupiter in Gemini, Saturn in Taurus. The question is: Should I change my job this year?", "output": "With Venus in Aquarius, your chart supports leadership roles. Expect progress around 2026."},
{"input": "Anjali was born on 1997-02-28 at 04:30 in Mumbai. The planetary positions were: Sun in Cancer, Moon in Capricorn, Venus in Virgo, Mars in Scorpio, Jupiter in Scorpio, Saturn in Leo. The question is: Will I succeed in business?", "output": "With Saturn in Aquarius, your chart supports leadership roles. Expect progress around 2026."},
{"input": "Priya was born on 1988-11-24 at 21:33 in Hyderabad. The planetary positions were: Sun in Capricorn, Moon in Scorpio, Venus in Aries, Mars in Aries, Jupiter in Capricorn, Saturn in Scorpio. The question is: Will I get a government job?", "output": "With Saturn in Sagittarius, your chart supports creative careers. Expect progress around 2026."},
{"input": "Amit was born on 1990-08-15 at 10:26 in Hyderabad. The planetary positions were: Sun in Taurus, Moon in Virgo, Venus in Leo, Mars in Sagittarius, Jupiter in Capricorn, Saturn in Libra. The question is: Will I succeed in business?", "output": "With Venus in Gemini, your chart supports public service. Expect progress around 2028."},
{"input": "Vikram was born on 1996-12-26 at 02:02 in Bangalore. The planetary positions were: Sun in Virgo, Moon in Virgo, Venus in Capricorn, Mars in Virgo, Jupiter in Pisces, Saturn in Aquarius. The question is: Will I succeed in business?", "output": "With Jupiter in Aquarius, your chart supports creative careers. Expect progress around 2028."},
{"input": "Amit was born on 1988-05-12 at 19:54 in Ahmedabad. The planetary positions were: Sun in Capricorn, Moon in Capricorn, Venus in Scorpio, Mars in Pisces, Jupiter in Pisces, Saturn in Leo. The question is: Will I get a government job?", "output": "With Saturn in Leo, your chart supports public service. Expect progress around 2027."},
{"input": "Amit was born on 1986-12-25 at 19:47 in Hyderabad. The planetary positions were: Sun in Libra, Moon in Aquarius, Venus in Gemini, Mars in Scorpio, Jupiter in Taurus, Saturn in Virgo. The question is: Will I get a government job?", "output": "With Jupiter in Gemini, your chart supports leadership roles. Expect progress around 2029."},
{"input": "Priya was born on 1987-04-09 at 21:17 in Chennai. The planetary positions were: Sun in Capricorn, Moon in Aries, Venus in Aries, Mars in Scorpio, Jupiter in Sagittarius, Saturn in Libra. The question is: Will I get a government job?", "output": "With Jupiter in Leo, your chart supports creative careers. Expect progress around 2025."},
{"input": "Sahil was born on 1992-12-25 at 01:59 in Chennai. The planetary positions were: Sun in Sagittarius, Moon in Scorpio, Venus in Taurus, Mars in Aquarius, Jupiter in Virgo, Saturn in Libra. The question is: Will I succeed in business?", "output": "With Mars in Capricorn, your chart supports leadership roles. Expect progress around 2029."},
{"input": "Sneha was born on 2003-06-22 at 05:28 in Bangalore. The planetary positions were: Sun in Virgo, Moon in Pisces, Venus in Taurus, Mars in Scorpio, Jupiter in Taurus, Saturn in Libra. The question is: Will I get a government job?", "output": "With Jupiter in Sagittarius, your chart supports public service. Expect progress around 2030."},
{"input": "Priya was born on 1997-03-25 at 15:36 in Hyderabad. The planetary positions were: Sun in Scorpio, Moon in Sagittarius, Venus in Capricorn, Mars in Libra, Jupiter in Scorpio, Saturn in Aquarius. The question is: Will I succeed in business?", "output": "With Saturn in Cancer, your chart supports public service. Expect progress around 2026."},
{"input": "Sneha was born on 1991-03-06 at 00:36 in Hyderabad. The planetary positions were: Sun in Taurus, Moon in Pisces, Venus in Taurus, Mars in Virgo, Jupiter in Cancer, Saturn in Aries. The question is: Will I succeed in business?", "output": "With Saturn in Pisces, your chart supports leadership roles. Expect progress around 2025."},
{"input": "Anjali was born on 2001-02-15 at 20:46 in Mumbai. The planetary positions were: Sun in Aquarius, Moon in Sagittarius, Venus in Aries, Mars in Scorpio, Jupiter in Aquarius, Saturn in Capricorn. The question is: Should I change my job this year?", "output": "With Jupiter in Leo, your chart supports creative careers. Expect progress around 2028."},
{"input": "Priya was born on 1985-10-07 at 06:21 in Mumbai. The planetary positions were: Sun in Taurus, Moon in Cancer, Venus in Virgo, Mars in Libra, Jupiter in Pisces, Saturn in Cancer. The question is: Will I succeed in business?", "output": "With Mars in Capricorn, your chart supports leadership roles. Expect progress around 2025."},
{"input": "Karan was born on 1992-03-18 at 14:45 in Bangalore. The planetary positions were: Sun in Sagittarius, Moon in Pisces, Venus in Sagittarius, Mars in Aquarius, Jupiter in Leo, Saturn in Aries. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2029. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Vikram was born on 1998-09-28 at 14:07 in Chennai. The planetary positions were: Sun in Virgo, Moon in Capricorn, Venus in Capricorn, Mars in Cancer, Jupiter in Capricorn, Saturn in Capricorn. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2027. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Sahil was born on 1987-03-01 at 00:03 in Jaipur. The planetary positions were: Sun in Sagittarius, Moon in Virgo, Venus in Scorpio, Mars in Capricorn, Jupiter in Libra, Saturn in Sagittarius. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2029. Avoid high-risk decisions when Mars is strong."},
{"input": "Meera was born on 1997-07-05 at 09:40 in Mumbai. The planetary positions were: Sun in Taurus, Moon in Libra, Venus in Aries, Mars in Aquarius, Jupiter in Pisces, Saturn in Pisces. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2026. Avoid high-risk decisions when Venus is strong."},
{"input": "Amit was born on 1993-08-24 at 23:34 in Ahmedabad. The planetary positions were: Sun in Leo, Moon in Pisces, Venus in Virgo, Mars in Aquarius, Jupiter in Leo, Saturn in Aquarius. The question is: Should I invest in property?", "output": "Financial growth is favored, especially after 2030. Avoid high-risk decisions when Venus is strong."},
{"input": "Sahil was born on 2003-04-21 at 08:17 in Lucknow. The planetary positions were: Sun in Aquarius, Moon in Sagittarius, Venus in Virgo, Mars in Gemini, Jupiter in Cancer, Saturn in Gemini. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2030. Avoid high-risk decisions when Saturn is strong."},
{"input": "Amit was born on 2001-12-18 at 12:20 in Pune. The planetary positions were: Sun in Aquarius, Moon in Scorpio, Venus in Gemini, Mars in Sagittarius, Jupiter in Pisces, Saturn in Virgo. The question is: Should I invest in property?", "output": "Financial growth is favored, especially after 2027. Avoid high-risk decisions when Venus is strong."},
{"input": "Anjali was born on 1989-01-11 at 22:58 in Jaipur. The planetary positions were: Sun in Capricorn, Moon in Scorpio, Venus in Capricorn, Mars in Taurus, Jupiter in Cancer, Saturn in Gemini. The question is: Should I invest in property?", "output": "Financial growth is favored, especially after 2029. Avoid high-risk decisions when Venus is strong."},
{"input": "Karan was born on 1989-12-09 at 22:21 in Delhi. The planetary positions were: Sun in Sagittarius, Moon in Virgo, Venus in Aries, Mars in Sagittarius, Jupiter in Sagittarius, Saturn in Virgo. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2025. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Sahil was born on 1999-01-06 at 23:44 in Lucknow. The planetary positions were: Sun in Virgo, Moon in Taurus, Venus in Libra, Mars in Virgo, Jupiter in Taurus, Saturn in Aquarius. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2029. Avoid high-risk decisions when Venus is strong."},
{"input": "Neha was born on 1989-10-10 at 20:10 in Jaipur. The planetary positions were: Sun in Scorpio, Moon in Virgo, Venus in Leo, Mars in Pisces, Jupiter in Aries, Saturn in Leo. The question is: Should I invest in property?", "output": "Financial growth is favored, especially after 2026. Avoid high-risk decisions when Saturn is strong."},
{"input": "Sahil was born on 1988-09-07 at 18:52 in Bangalore. The planetary positions were: Sun in Taurus, Moon in Pisces, Venus in Taurus, Mars in Cancer, Jupiter in Pisces, Saturn in Leo. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2029. Avoid high-risk decisions when Saturn is strong."},
{"input": "Meera was born on 1987-04-14 at 07:57 in Chennai. The planetary positions were: Sun in Leo, Moon in Taurus, Venus in Cancer, Mars in Aries, Jupiter in Libra, Saturn in Libra. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2030. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Sneha was born on 1985-04-06 at 20:50 in Hyderabad. The planetary positions were: Sun in Capricorn, Moon in Leo, Venus in Scorpio, Mars in Pisces, Jupiter in Scorpio, Saturn in Capricorn. The question is: Will I become rich?", "output": "Financial growth is favored, especially after 2026. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Meera was born on 2001-04-06 at 06:49 in Kolkata. The planetary positions were: Sun in Pisces, Moon in Taurus, Venus in Virgo, Mars in Libra, Jupiter in Libra, Saturn in Taurus. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2027. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Neha was born on 1986-08-27 at 20:05 in Mumbai. The planetary positions were: Sun in Libra, Moon in Aquarius, Venus in Virgo, Mars in Leo, Jupiter in Scorpio, Saturn in Aries. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2027. Avoid high-risk decisions when Mars is strong."},
{"input": "Amit was born on 1997-12-11 at 18:46 in Chennai. The planetary positions were: Sun in Aquarius, Moon in Capricorn, Venus in Cancer, Mars in Pisces, Jupiter in Aries, Saturn in Gemini. The question is: Should I invest in property?", "output": "Financial growth is favored, especially after 2026. Avoid high-risk decisions when Venus is strong."},
{"input": "Rahul was born on 1990-06-25 at 13:24 in Mumbai. The planetary positions were: Sun in Aries, Moon in Aquarius, Venus in Virgo, Mars in Pisces, Jupiter in Virgo, Saturn in Gemini. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2027. Avoid high-risk decisions when Saturn is strong."},
{"input": "Vikram was born on 2003-02-28 at 15:41 in Lucknow. The planetary positions were: Sun in Libra, Moon in Cancer, Venus in Leo, Mars in Sagittarius, Jupiter in Scorpio, Saturn in Pisces. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2025. Avoid high-risk decisions when Venus is strong."},
{"input": "Meera was born on 1996-10-19 at 19:19 in Kolkata. The planetary positions were: Sun in Capricorn, Moon in Pisces, Venus in Capricorn, Mars in Scorpio, Jupiter in Aries, Saturn in Taurus. The question is: Will I face financial problems?", "output": "Financial growth is favored, especially after 2028. Avoid high-risk decisions when Jupiter is strong."},
{"input": "Vikram was born on 1988-07-22 at 05:59 in Ahmedabad. The planetary positions were: Sun in Leo, Moon in Cancer, Venus in Gemini, Mars in Sagittarius, Jupiter in Libra, Saturn in Aries. The question is: Will I have any health issues?", "output": "Health looks stable, but Venus in Cancer signals caution. Focus on diet and regular checkups."},
{"input": "Meera was born on 1987-08-03 at 03:49 in Delhi. The planetary positions were: Sun in Capricorn, Moon in Sagittarius, Venus in Sagittarius, Mars in Taurus, Jupiter in Leo, Saturn in Cancer. The question is: Is there a risk of chronic disease?", "output": "Health looks stable, but Saturn in Aquarius signals caution. Focus on diet and regular checkups."},
{"input": "Sneha was born on 2000-10-06 at 04:07 in Chennai. The planetary positions were: Sun in Taurus, Moon in Cancer, Venus in Aquarius, Mars in Libra, Jupiter in Aries, Saturn in Taurus. The question is: Will I have any health issues?", "output": "Health looks stable, but Jupiter in Virgo signals caution. Focus on diet and regular checkups."},
{"input": "Amit was born on 1985-09-03 at 12:25 in Kolkata. The planetary positions were: Sun in Aquarius, Moon in Aries, Venus in Cancer, Mars in Pisces, Jupiter in Taurus, Saturn in Taurus. The question is: Is there a risk of chronic disease?", "output": "Health looks stable, but Jupiter in Leo signals caution. Focus on diet and regular checkups."},
{"input": "Neha was born on 1994-03-22 at 08:09 in Ahmedabad. The planetary positions were: Sun in Taurus, Moon in Capricorn, Venus in Cancer, Mars in Pisces, Jupiter in Capricorn, Saturn in Scorpio. The question is: How will my health be in old age?", "output": "Health looks stable, but Jupiter in Cancer signals caution. Focus on diet and regular checkups."},
{"input": "Anjali was born on 1992-09-02 at 15:20 in Ahmedabad. The planetary positions were: Sun in Aquarius, Moon in Scorpio, Venus in Taurus, Mars in Leo, Jupiter in Leo, Saturn in Sagittarius. The question is: How will my health be in old age?", "output": "Health looks stable, but Venus in Aquarius signals caution. Focus on diet and regular checkups."},
{"input": "Anjali was born on 2003-07-07 at 00:05 in Hyderabad. The planetary positions were: Sun in Scorpio, Moon in Pisces, Venus in Leo, Mars in Scorpio, Jupiter in Aquarius, Saturn in Leo. The question is: Will I have any health issues?", "output": "Health looks stable, but Mars in Pisces signals caution. Focus on diet and regular checkups."},
{"input": "Amit was born on 1997-01-27 at 08:15 in Jaipur. The planetary positions were: Sun in Libra, Moon in Virgo, Venus in Gemini, Mars in Gemini, Jupiter in Cancer, Saturn in Virgo. The question is: Will I have any health issues?", "output": "Health looks stable, but Venus in Taurus signals caution. Focus on diet and regular checkups."},
{"input": "Sneha was born on 1991-01-27 at 11:24 in Pune. The planetary positions were: Sun in Leo, Moon in Aquarius, Venus in Taurus, Mars in Gemini, Jupiter in Sagittarius, Saturn in Pisces. The question is: Will I have any health issues?", "output": "Health looks stable, but Mars in Aries signals caution. Focus on diet and regular checkups."},
{"input": "Anjali was born on 1985-09-25 at 19:12 in Hyderabad. The planetary positions were: Sun in Libra, Moon in Sagittarius, Venus in Gemini, Mars in Leo, Jupiter in Pisces, Saturn in Libra. The question is: Will I have any health issues?", "output": "Health looks stable, but Mars in Pisces signals caution. Focus on diet and regular checkups."},
{"input": "Meera was born on 1985-06-24 at 03:39 in Mumbai. The planetary positions were: Sun in Aquarius, Moon in Taurus, Venus in Aquarius, Mars in Leo, Jupiter in Virgo, Saturn in Aries. The question is: Is there a risk of chronic disease?", "output": "Health looks stable, but Mars in Sagittarius signals caution. Focus on diet and regular checkups."},
{"input": "Sneha was born on 1988-10-22 at 03:33 in Ahmedabad. The planetary positions were: Sun in Libra, Moon in Pisces, Venus in Leo, Mars in Taurus, Jupiter in Gemini, Saturn in Scorpio. The question is: How will my health be in old age?", "output": "Health looks stable, but Saturn in Libra signals caution. Focus on diet and regular checkups."},
{"input": "Vikram was born on 1994-03-22 at 02:52 in Jaipur. The planetary positions were: Sun in Taurus, Moon in Capricorn, Venus in Aries, Mars in Virgo, Jupiter in Sagittarius, Saturn in Gemini. The question is: How will my health be in old age?", "output": "Health looks stable, but Saturn in Libra signals caution. Focus on diet and regular checkups."},
{"input": "Anjali was born on 1990-12-15 at 12:38 in Hyderabad. The planetary positions were: Sun in Gemini, Moon in Libra, Venus in Cancer, Mars in Scorpio, Jupiter in Sagittarius, Saturn in Libra. The question is: Is there a risk of chronic disease?", "output": "Health looks stable, but Saturn in Gemini signals caution. Focus on diet and regular checkups."},
{"input": "Neha was born on 1997-12-11 at 16:27 in Lucknow. The planetary positions were: Sun in Cancer, Moon in Cancer, Venus in Pisces, Mars in Aries, Jupiter in Cancer, Saturn in Aries. The question is: Will I have any health issues?", "output": "Health looks stable, but Venus in Leo signals caution. Focus on diet and regular checkups."},
{"input": "Priya was born on 1991-08-23 at 22:08 in Jaipur. The planetary positions were: Sun in Cancer, Moon in Gemini, Venus in Capricorn, Mars in Virgo, Jupiter in Pisces, Saturn in Aries. The question is: How will my health be in old age?", "output": "Health looks stable, but Jupiter in Cancer signals caution. Focus on diet and regular checkups."},
{"input": "Vikram was born on 1986-09-13 at 17:41 in Jaipur. The planetary positions were: Sun in Taurus, Moon in Aquarius, Venus in Cancer, Mars in Libra, Jupiter in Capricorn, Saturn in Capricorn. The question is: Is there a risk of chronic disease?", "output": "Health looks stable, but Venus in Aquarius signals caution. Focus on diet and regular checkups."},
{"input": "Priya was born on 1986-05-10 at 02:45 in Bangalore. The planetary positions were: Sun in Scorpio, Moon in Aquarius, Venus in Libra, Mars in Sagittarius, Jupiter in Libra, Saturn in Aquarius. The question is: How will my health be in old age?", "output": "Health looks stable, but Venus in Pisces signals caution. Focus on diet and regular checkups."},
{"input": "Sneha was born on 1993-06-27 at 21:30 in Delhi. The planetary positions were: Sun in Libra, Moon in Cancer, Venus in Cancer, Mars in Leo, Jupiter in Capricorn, Saturn in Leo. The question is: Will I have any health issues?", "output": "Health looks stable, but Venus in Capricorn signals caution. Focus on diet and regular checkups."},
{"input": "Priya was born on 1997-08-12 at 17:19 in Bangalore. The planetary positions were: Sun in Virgo, Moon in Cancer, Venus in Cancer, Mars in Taurus, Jupiter in Aquarius, Saturn in Cancer. The question is: Will I have any health issues?", "output": "Health looks stable, but Venus in Sagittarius signals caution. Focus on diet and regular checkups."},
{"input": "Karan was born on 1985-11-11 at 18:56 in Jaipur. The planetary positions were: Sun in Gemini, Moon in Sagittarius, Venus in Taurus, Mars in Aries, Jupiter in Gemini, Saturn in Pisces. The question is: Will I settle abroad?", "output": "Your life post-35 will bring career growth. Saturn in Gemini supports this shift."},
{"input": "Meera was born on 1994-05-17 at 08:35 in Ahmedabad. The planetary positions were: Sun in Cancer, Moon in Aquarius, Venus in Virgo, Mars in Pisces, Jupiter in Gemini, Saturn in Sagittarius. The question is: What major changes will happen in my life?", "output": "Your life post-30 will bring spiritual awakening. Saturn in Libra supports this shift."},
{"input": "Rahul was born on 2003-05-07 at 23:40 in Mumbai. The planetary positions were: Sun in Libra, Moon in Libra, Venus in Pisces, Mars in Pisces, Jupiter in Aquarius, Saturn in Cancer. The question is: What major changes will happen in my life?", "output": "Your life post-34 will bring financial stability. Venus in Aquarius supports this shift."},
{"input": "Sahil was born on 1991-05-07 at 04:09 in Delhi. The planetary positions were: Sun in Virgo, Moon in Leo, Venus in Taurus, Mars in Pisces, Jupiter in Leo, Saturn in Sagittarius. The question is: How will my life be after 30?", "output": "Your life post-34 will bring marriage. Venus in Capricorn supports this shift."},
{"input": "Meera was born on 1988-08-10 at 04:27 in Kolkata. The planetary positions were: Sun in Aries, Moon in Pisces, Venus in Gemini, Mars in Gemini, Jupiter in Taurus, Saturn in Libra. The question is: Will I settle abroad?", "output": "Your life post-35 will bring marriage. Mars in Cancer supports this shift."},
{"input": "Amit was born on 1998-02-05 at 14:58 in Jaipur. The planetary positions were: Sun in Capricorn, Moon in Cancer, Venus in Aquarius, Mars in Gemini, Jupiter in Libra, Saturn in Sagittarius. The question is: Will I settle abroad?", "output": "Your life post-31 will bring career growth. Saturn in Virgo supports this shift."},
{"input": "Amit was born on 1986-07-03 at 19:54 in Kolkata. The planetary positions were: Sun in Aquarius, Moon in Virgo, Venus in Capricorn, Mars in Capricorn, Jupiter in Leo, Saturn in Sagittarius. The question is: Will I settle abroad?", "output": "Your life post-40 will bring spiritual awakening. Mars in Cancer supports this shift."},
{"input": "Meera was born on 1995-12-02 at 09:33 in Hyderabad. The planetary positions were: Sun in Aries, Moon in Leo, Venus in Taurus, Mars in Gemini, Jupiter in Scorpio, Saturn in Taurus. The question is: How will my life be after 30?", "output": "Your life post-39 will bring spiritual awakening. Jupiter in Sagittarius supports this shift."},
{"input": "Meera was born on 2000-02-18 at 05:31 in Lucknow. The planetary positions were: Sun in Scorpio, Moon in Aquarius, Venus in Virgo, Mars in Libra, Jupiter in Aries, Saturn in Sagittarius. The question is: Will I settle abroad?", "output": "Your life post-33 will bring marriage. Saturn in Sagittarius supports this shift."},
{"input": "Vikram was born on 1988-01-27 at 17:52 in Kolkata. The planetary positions were: Sun in Cancer, Moon in Sagittarius, Venus in Leo, Mars in Taurus, Jupiter in Gemini, Saturn in Cancer. The question is: Will I settle abroad?", "output": "Your life post-39 will bring marriage. Jupiter in Scorpio supports this shift."},
{"input": "Vikram was born on 1991-01-07 at 05:23 in Pune. The planetary positions were: Sun in Cancer, Moon in Pisces, Venus in Virgo, Mars in Virgo, Jupiter in Libra, Saturn in Capricorn. The question is: How will my life be after 30?", "output": "Your life post-32 will bring career growth. Mars in Libra supports this shift."},
{"input": "Neha was born on 1987-02-03 at 22:23 in Pune. The planetary positions were: Sun in Cancer, Moon in Gemini, Venus in Virgo, Mars in Libra, Jupiter in Sagittarius, Saturn in Sagittarius. The question is: What major changes will happen in my life?", "output": "Your life post-30 will bring marriage. Saturn in Libra supports this shift."},
{"input": "Neha was born on 2001-10-28 at 12:51 in Ahmedabad. The planetary positions were: Sun in Aries, Moon in Gemini, Venus in Sagittarius, Mars in Libra, Jupiter in Virgo, Saturn in Virgo. The question is: What major changes will happen in my life?", "output": "Your life post-37 will bring spiritual awakening. Jupiter in Scorpio supports this shift."},
{"input": "Priya was born on 1990-06-19 at 00:14 in Kolkata. The planetary positions were: Sun in Aries, Moon in Libra, Venus in Leo, Mars in Gemini, Jupiter in Pisces, Saturn in Cancer. The question is: Will I settle abroad?", "output": "Your life post-34 will bring spiritual awakening. Mars in Sagittarius supports this shift."},
{"input": "Priya was born on 1993-12-13 at 15:05 in Hyderabad. The planetary positions were: Sun in Scorpio, Moon in Virgo, Venus in Aquarius, Mars in Aquarius, Jupiter in Taurus, Saturn in Pisces. The question is: Will I settle abroad?", "output": "Your life post-36 will bring career growth. Venus in Sagittarius supports this shift."},
{"input": "Sneha was born on 1995-12-11 at 13:14 in Kolkata. The planetary positions were: Sun in Gemini, Moon in Taurus, Venus in Pisces, Mars in Gemini, Jupiter in Capricorn, Saturn in Aries. The question is: Will I settle abroad?", "output": "Your life post-39 will bring spiritual awakening. Jupiter in Virgo supports this shift."},
{"input": "Karan was born on 1994-03-10 at 12:37 in Ahmedabad. The planetary positions were: Sun in Leo, Moon in Capricorn, Venus in Leo, Mars in Libra, Jupiter in Virgo, Saturn in Cancer. The question is: How will my life be after 30?", "output": "Your life post-39 will bring career growth. Venus in Gemini supports this shift."},
{"input": "Meera was born on 1993-09-25 at 05:42 in Chennai. The planetary positions were: Sun in Libra, Moon in Virgo, Venus in Sagittarius, Mars in Gemini, Jupiter in Aries, Saturn in Capricorn. The question is: Will I settle abroad?", "output": "Your life post-38 will bring spiritual awakening. Saturn in Scorpio supports this shift."},
{"input": "Neha was born on 1992-02-03 at 07:36 in Bangalore. The planetary positions were: Sun in Virgo, Moon in Gemini, Venus in Taurus, Mars in Sagittarius, Jupiter in Gemini, Saturn in Pisces. The question is: What major changes will happen in my life?", "output": "Your life post-36 will bring financial stability. Mars in Sagittarius supports this shift."},
{"input": "Sahil was born on 1998-03-01 at 01:03 in Chennai. The planetary positions were: Sun in Pisces, Moon in Leo, Venus in Virgo, Mars in Sagittarius, Jupiter in Scorpio, Saturn in Taurus. The question is: How will my life be after 30?", "output": "Your life post-31 will bring spiritual awakening. Saturn in Gemini supports this shift."},
{
    "input": "Amit was born on 1991-04-23 at 06:45 in Delhi. The planetary positions were: Sun in Taurus, Moon in Cancer, Venus in Pisces, Mars in Capricorn, Jupiter in Aries, Saturn in Gemini. The question is: Will I find true love soon?",
    "output": "Your love life improves after age 34. Venus in Pisces suggests a soulful romantic connection coming into your life."
  },
  {
    "input": "Reema was born on 1990-12-09 at 21:30 in Mumbai. The planetary positions were: Sun in Sagittarius, Moon in Aquarius, Venus in Capricorn, Mars in Scorpio, Jupiter in Virgo, Saturn in Aquarius. The question is: Will I have children?",
    "output": "Your chart supports motherhood after age 33. Mars in Scorpio suggests intensity and transformation through parenting."
  },
  {
    "input": "Arjun was born on 1989-08-17 at 11:15 in Bangalore. The planetary positions were: Sun in Leo, Moon in Virgo, Venus in Libra, Mars in Leo, Jupiter in Gemini, Saturn in Cancer. The question is: How will my health be in the future?",
    "output": "Your health stabilizes post-35. Moon in Virgo suggests a focus on diet, routine, and natural healing."
  },
  {
    "input": "Sanya was born on 1995-03-03 at 14:20 in Pune. The planetary positions were: Sun in Pisces, Moon in Libra, Venus in Aquarius, Mars in Aries, Jupiter in Cancer, Saturn in Aries. The question is: Will I get married soon?",
    "output": "Your chart supports union after 30. Venus in Aquarius may bring an unconventional or distant partner."
  },
  {
    "input": "Nikhil was born on 1992-06-15 at 02:10 in Kolkata. The planetary positions were: Sun in Gemini, Moon in Taurus, Venus in Cancer, Mars in Gemini, Jupiter in Virgo, Saturn in Capricorn. The question is: Will I settle abroad?",
    "output": "Your life post-33 shows movement. Jupiter in Virgo favors working abroad in service or tech fields."
  },
  {
    "input": "Kriti was born on 1987-11-29 at 08:00 in Jaipur. The planetary positions were: Sun in Sagittarius, Moon in Pisces, Venus in Sagittarius, Mars in Virgo, Jupiter in Scorpio, Saturn in Aries. The question is: What career path suits me?",
    "output": "Your path opens through education and media. Sun and Venus in Sagittarius favor teaching or publishing."
  },
  {
    "input": "Varun was born on 1996-01-20 at 12:35 in Chandigarh. The planetary positions were: Sun in Capricorn, Moon in Leo, Venus in Sagittarius, Mars in Aquarius, Jupiter in Scorpio, Saturn in Pisces. The question is: Will I experience spiritual awakening?",
    "output": "Yes, especially post-32. Jupiter in Scorpio supports deep inner work and Saturn in Pisces adds karmic growth."
  },
  {
    "input": "Pooja was born on 1993-07-12 at 17:40 in Hyderabad. The planetary positions were: Sun in Cancer, Moon in Libra, Venus in Leo, Mars in Taurus, Jupiter in Libra, Saturn in Virgo. The question is: How will my family life be?",
    "output": "Your chart suggests a balanced home life after age 30. Venus in Leo brings love and warmth to your domestic space."
  },
  {
    "input": "Aditya was born on 1990-02-05 at 04:50 in Ahmedabad. The planetary positions were: Sun in Aquarius, Moon in Capricorn, Venus in Aquarius, Mars in Gemini, Jupiter in Sagittarius, Saturn in Taurus. The question is: Will I be successful in business?",
    "output": "Yes, especially post-35. Jupiter in Sagittarius and Venus in Aquarius support innovation and expansion."
  },
  {
    "input": "Meghna was born on 1991-10-19 at 10:10 in Lucknow. The planetary positions were: Sun in Libra, Moon in Gemini, Venus in Virgo, Mars in Scorpio, Jupiter in Capricorn, Saturn in Leo. The question is: How will my career grow?",
    "output": "Your career advances steadily post-36. Mars in Scorpio shows strategic leadership, while Jupiter in Capricorn supports structure."
  },
  {
    "input": "Ravi was born on 1994-05-06 at 23:35 in Bhopal. The planetary positions were: Sun in Taurus, Moon in Scorpio, Venus in Aries, Mars in Pisces, Jupiter in Leo, Saturn in Virgo. The question is: Will I have a peaceful life?",
    "output": "Your life gains peace after age 33. Moon in Scorpio brings emotional depth, but stability increases with maturity."
  },
  {
    "input": "Anita was born on 1988-09-30 at 01:20 in Surat. The planetary positions were: Sun in Libra, Moon in Cancer, Venus in Leo, Mars in Sagittarius, Jupiter in Pisces, Saturn in Scorpio. The question is: Will I change careers?",
    "output": "Yes, around age 38. Mars in Sagittarius drives learning and Saturn in Scorpio pushes for transformation."
  }


]
